{
  "active": {
    "name": "Dayse Borges",
    "img": "dayse",
    "text1": "\"Joaquin es un profesional extremadamente enfocado y analítico que siempre busca mejorar los procesos y adquirir nuevos conocimientos. Es una excelente persona...\""
  },

  "pasive": [
    {
      "name": "Florencia Banco Cano",
      "img": "flor1",
      "text1": "\"Joaquin es una persona muy respetuosa, comprometida, dedicada y participativa. Su esfuerzo y compromiso es notable! Gran profesional y persona.\""
    },
    {
      "name": "Joaquin Delgado",
      "img": "joaquin",
      "text1": "\"Joaquin es una persona que siempre esta dispuesto a trabajar y aportar nuevas ideas. Es una persona decidida y enfocada en sus objetivos, ademas de ser un gran compañero.\""
    },
    {
      "name": "Monica Schettino",
      "img": "monica",
      "text1": "\"Joaquín es una de esas personas que todo equipo IT quiere tener! La curiosidad por aprender, el deseo de auto superarse, las metas claras y la tenacidad lo caracterizan...\""
    },
    {
      "name": "Monica Schettino",
      "img": "monica",
      "text1": "\"...Sabés que contás con él y tenés la certeza de que cumple con los objetivos en tiempo y forma...\""
    },
    {
      "name": "Monica Schettino",
      "img": "monica",
      "text1": "\"...Perseverante, analítico, orientado a resultados. Es un recurso valioso que sumará muchísimo tanto a nivel laboral y humano\""
    },
    {
      "name": "Gerald Mickelsen",
      "img": "gerald",
      "text1": "\"...Su habilidad para guiar y motivar a su equipo hacia objetivos claros y alcanzables ha sido un factor fundamental para alcanzar y, en ocasiones, superar nuestras metas...\""
    },
    {
      "name": "Gerald Mickelsen",
      "img": "gerald",
      "text1": "\"...Siempre está dispuesto a escuchar y entender las preocupaciones de sus compañeros, y no duda en proporcionar soluciones adecuadas...\""
    },
    {
      "name": "Gerald Mickelsen",
      "img": "gerald",
      "text1": "\"...Su audacia para tomar decisiones y su habilidad para comunicarse de manera efectiva han jugado un papel crucial en la superación de desafíos...\""
    },
    {
      "name": "Nixon Batallas",
      "img": "nixon",
      "text1": "\"...Joaquin demostró su gran conocimiento técnico, dedicación y creatividad, yendo siempre más allá de lo planteado y cumpliendo con gran responsabilidad la meta propuesta...\""
    },
    {
      "name": "Nixon Batallas",
      "img": "nixon",
      "text1": "\"...Joaquin demostró su gran capacidad de liderazgo, lo cual fue parte fundamental para la organización y planificación del proyecto...\""
    },
    {
      "name": "Nixon Batallas",
      "img": "nixon",
      "text1": "\"...Su gran calidad humana hace que Joaquin transmita entusiasmo para que el ambiente de trabajo sea un espacio de satisfacción, compromiso y aprendizaje continuo...\""
    }
  ]
}
