{
  "active": {
    "name": "Dayse Borges",
    "img": "dayse",
    "text1": "\"Joaquín é um profissional extremamente focado e analítico que está sempre procurando melhorar os processos e adquirir novos conhecimentos. Ele é uma excelente pessoa e está sempre disposto a ajudar.\""
  },

  "pasive": [
    {
      "name": "Florencia Banco Cano",
      "img": "flor1",
      "text1": "\"Joaquin é uma pessoa muito respeitosa, comprometida, dedicada e participativa. Seu esforço e compromisso são notáveis! Grande profissional e pessoa.\""
    },
    {
      "name": "Joaquin Delgado",
      "img": "joaquin",
      "text1": "\"Joaquin é uma pessoa que está sempre disposta a trabalhar e contribuir com novas idéias. Ele é determinado e focado em seus objetivos, além de ser um grande companheiro.\""
    },
    {
      "name": "Monica Schettino",
      "img": "monica",
      "text1": "\"O Joaquin é uma daquelas pessoas que todas as equipas de TI querem ter! O caracterizam sua curiosidade em aprender, o desejo de se aperfeiçoar, os seus objectivos claros e a sua tenacidade...\""
    },
    {
      "name": "Monica Schettino",
      "img": "monica",
      "text1": "\"...Voce sabe que pode contar com ele e pode ter a certeza de que cumprirá os objectivos a tempo e da melhor forma....\""
    },
    {
      "name": "Monica Schettino",
      "img": "monica",
      "text1": "\"...Ele é perseverante, analítico e orientado a resultados. É um recurso valioso que irá acrescentar muito, tanto como profissional quanto como pessoa.\""
    },
    {
      "name": "Gerald Mickelsen",
      "img": "gerald",
      "text1": "\"...Sua capacidade de orientar e motivar sua equipe em direção a metas claras e alcançáveis tem sido um fator importante para atingir e, às vezes, superar nossas metas..."
    },
    {
      "name": "Gerald Mickelsen",
      "img": "gerald",
      "text1": "\"...Ele está sempre disposto a ouvir e entender as preocupações de seus colegas e não hesita em fornecer soluções adequadas..."
    },
    {
      "name": "Gerald Mickelsen",
      "img": "gerald",
      "text1": "\"...Sua ousadia na tomada de decisões e sua capacidade de se comunicar com eficiência desempenharam um papel crucial na superação de desafios..."
    },
    {
      "name": "Nixon Batallas",
      "img": "nixon",
      "text1": "\"...Joaquin demonstrou seu grande conhecimento técnico, dedicação e criatividade, sempre indo além do que foi planejado e cumprindo a meta proposta com grande responsabilidade...\""
    },
    {
      "name": "Nixon Batallas",
      "img": "nixon",
      "text1": "\"...Joaquin tem demonstrado sua grande capacidade de liderança, que foi parte fundamental da organização e do planejamento do projeto...\""
    },
    {
      "name": "Nixon Batallas",
      "img": "nixon",
      "text1": "\"...Sua grande qualidade humana faz com que Joaquin transmita entusiasmo para que o ambiente de trabalho seja um espaço de satisfação, comprometimento e aprendizado contínuo...\""
    }
  ]
}
